#include"total.h"
//主菜单
void printf_menu() {
	system("cls");
	printf("          *******银行账户管理系统*******\n\n\n");
	printf("_________________________________________________\n");
	printf("                 1. 注册账户\n");
	printf("_________________________________________________\n");
	printf("                 2. 登录账户\n");
	printf("_________________________________________________\n");
	printf("                 3. 登录管理员账户\n");
	printf("_________________________________________________\n");
	printf("                 4. 退出系统\n");
	printf("_________________________________________________\n");
	system("pause");
	printf("\n请您输入你要进行的相应操作前的数字:\n");
	printf("→");
	
}
//登录界面
void printf_login() {
	system("pause");
	system("cls");
	printf("          *******银行账户管理系统*******\n\n\n");
	printf("                 请选择操作：\n");
	printf("_________________________________________________\n");
	printf("                 1.查询余额\n");
	printf("_________________________________________________\n");
	printf("                 2. 存款\n");
	printf("_________________________________________________\n");
	printf("                 3. 取款\n");
	printf("_________________________________________________\n");
	printf("                 4. 转账\n");
	printf("_________________________________________________\n");
	printf("                 5. 退出\n");
	printf("_________________________________________________\n");
}
//管理员界面
void printf_admin() {
	system("pause");
	system("cls");
	printf("          *******银行账户管理系统*******\n\n\n");

	printf("                 请选择操作：\n");

	printf("_________________________________________________\n");
	printf("                 1. 查询账户\n");

	printf("_________________________________________________\n");
	printf("                 2. 修改账户\n");

	printf("_________________________________________________\n");
	printf("                 3. 退出\n");

	printf("_________________________________________________\n");
}